package android.pvt.moviefortheevening

val SUCCESS_RESPONSE = """"{
    "page": 1,
    "total_results": 4549,
    "total_pages": 228,
    "results": [
    {
        "popularity": 30.184,
        "vote_count": 12621,
        "video": false,
        "poster_path": "/3oOBjD1LZCjfrLPPL49xP9fFgeR.jpg",
        "id": 272,
        "adult": false,
        "backdrop_path": "/9myrRcegWGGp24mpVfkD4zhUfhi.jpg",
        "original_language": "en",
        "original_title": "Batman Begins",
        "genre_ids": [
        28,
        80,
        18
        ],
        "title": "Бэтмен: Начало",
        "vote_average": 7.6,
        "overview": "Это иной Бэтмэн. Это новое начало. История о происхождении легенды Брюса Уэйна, юного наследника огромного состояния, потерявшего своих родителей. Покинув родной Готэм, он отправляется в путешествие по миру. Многочисленные преграды и лишения закаляют его характер, а мудрый наставник помогает вновь обрести смысл жизни. Легендарный герой, защитник слабых, борец с несправедливостью преображается у тебя на глазах. Вернувшись в Готэм, Бэтмэн становится единственной преградой на пути у сил зла, готовых ввергнуть город во мрак беззакония.",
        "release_date": "2005-06-10"
    },
    {
        "popularity": 39.856,
        "vote_count": 19544,
        "video": false,
        "poster_path": "/zHmfOXRgcUb2Sd79bttsZNokYbS.jpg",
        "id": 155,
        "adult": false,
        "backdrop_path": "/hqkIcbrOHL86UncnHIsHVcVmzue.jpg",
        "original_language": "en",
        "original_title": "The Dark Knight",
        "genre_ids": [
        28,
        80,
        18,
        53
        ],
        "title": "Тёмный рыцарь",
        "vote_average": 8.4,
        "overview": "Бэтмен поднимает ставки в войне с криминалом. С помощью лейтенанта Джима Гордона и прокурора Харви Дента он намерен очистить улицы от преступности, отравляющей город. Сотрудничество оказывается эффективным, но скоро они обнаружат себя посреди хаоса, развязанного восходящим криминальным гением, известным испуганным горожанам под именем Джокер.",
        "release_date": "2008-08-14"
    },
    {
        "popularity": 34.321,
        "vote_count": 13708,
        "video": false,
        "poster_path": "/yvmKPlTIi0xdcFQIFcQKQJcI63W.jpg",
        "id": 278,
        "adult": false,
        "backdrop_path": "/j9XKiZrVeViAixVRzCta7h1VU9W.jpg",
        "original_language": "en",
        "original_title": "The Shawshank Redemption",
        "genre_ids": [
        80,
        18
        ],
        "title": "Побег из Шоушенка",
        "vote_average": 8.7,
        "overview": "Фильм удостоен шести номинаций на «Оскар», в том числе и как лучший фильм года. Шоушенк — название тюрьмы. И если тебе нет еще 30-ти, а ты получаешь пожизненное, то приготовься к худшему: для тебя выхода из Шоушенка не будет! Актриса Рита Хэйворт — любимица всей Америки. Энди Дифрейну она тоже очень нравилась. Рита никогда не слышала о существовании Энди, однако жизнь Дифрейну, бывшему вице-президенту крупного банка, осужденному за убийство жены и ее любовника, Рита Хэйворт все-таки спасла.",
        "release_date": "1994-09-23"
    },
    {
        "popularity": 40.43,
        "vote_count": 16937,
        "video": false,
        "poster_path": "/hTjHSmQGiaUMyIx3Z25Q1iktCFD.jpg",
        "id": 550,
        "adult": false,
        "backdrop_path": "/mMZRKb3NVo5ZeSPEIaNW9buLWQ0.jpg",
        "original_language": "en",
        "original_title": "Fight Club",
        "genre_ids": [
        18
        ],
        "title": "Бойцовский клуб",
        "vote_average": 8.4,
        "overview": "Терзаемый хронической бессоницей и отчаянно пытающийся вырваться из мучительно скучной жизни клерк встречает некоего Тайлера Дардена, харизматического торговца мылом с извращенной философией. Тайлер уверен, что самосовершенствование — удел слабых, а саморазрушение — единственное, ради чего стоит жить.",
        "release_date": "2000-01-13"
    },
    {
        "popularity": 32.304,
        "vote_count": 10803,
        "video": false,
        "poster_path": "/j8tdiuhbF9p5mnAeA1YOUvz82xY.jpg",
        "id": 8587,
        "adult": false,
        "backdrop_path": "/kZ9CKeZeKMUtrjZ7RuArjVMTDF4.jpg",
        "original_language": "en",
        "original_title": "The Lion King",
        "genre_ids": [
        16,
        18,
        10751
        ],
        "title": "Король Лев",
        "vote_average": 8.2,
        "overview": "У величественного Короля-Льва Муфасы рождается наследник по имени Симба. Уже в детстве любознательный малыш становится жертвой интриг своего завистливого дяди Шрама, мечтающего о власти. Симба познаёт горе утраты, предательство и изгнание, но в конце концов обретает верных друзей и находит любимую. Закалённый испытаниями, он в нелёгкой борьбе отвоёвывает своё законное место в «Круге жизни», осознав, что значит быть настоящим Королём.",
        "release_date": "1995-01-20"
    },
    {
        "popularity": 31.442,
        "vote_count": 5586,
        "video": false,
        "poster_path": "/ghdqwC323Mh7R6THjauD1Ge1sAx.jpg",
        "id": 627,
        "adult": false,
        "backdrop_path": "/Aw0z8bUhGljT0ots6udf1MTLEMi.jpg",
        "original_language": "en",
        "original_title": "Trainspotting",
        "genre_ids": [
        80,
        18
        ],
        "title": "На игле",
        "vote_average": 8,
        "overview": "Этим парням нужно только одно – доза. Они живут в собственном мире, грязном, грубом до примитивности и очень, очень жестоком. Но это их выбор – жизнь на игле. Мозги уже изъедены героином, а потому позволено все – воровать в магазинах, соблазнять школьниц, лгать в суде. И когда Марк ограбил собственных друзей, которые много раз делили с ним дозу, угрызения совести мучили его не слишком долго, ведь он решил начать новую жизнь. Теперь все у него будет по-другому – больше никаких наркотиков, он станет работать, сделает карьеру, купит хороший дом, машину, заведет семью…",
        "release_date": "1996-02-23"
    },
    {
        "popularity": 24.733,
        "vote_count": 14845,
        "video": false,
        "poster_path": "/r3sYKBtoNHPyS9vkaA8dJyh8grG.jpg",
        "id": 597,
        "adult": false,
        "backdrop_path": "/xqQztbT6KlPLQLlRtNHoXivEMZA.jpg",
        "original_language": "en",
        "original_title": "Titanic",
        "genre_ids": [
        18,
        53,
        10749
        ],
        "title": "Титаник",
        "vote_average": 7.8,
        "overview": "Молодые влюбленные Джек и Роза находят друг друга в первом и последнем плавании «непотопляемого» Титаника. Они не могли знать, что шикарный лайнер столкнется с айсбергом в холодных водах Северной Атлантики, и их страстная любовь превратится в схватку со смертью…",
        "release_date": "1997-11-18"
    },
    {
        "popularity": 31.977,
        "vote_count": 8418,
        "video": false,
        "poster_path": "/4K8fGGcJP2EoGDucILnaJcOJhZl.jpg",
        "id": 424,
        "adult": false,
        "backdrop_path": "/cTNYRUTXkBgPH3wP3kmPUB5U6dA.jpg",
        "original_language": "en",
        "original_title": "Schindler's List",
        "genre_ids": [
        18,
        36,
        10752
        ],
        "title": "Список Шиндлера",
        "vote_average": 8.5,
        "overview": "Лента рассказывает реальную историю загадочного Оскара Шиндлера, члена нацистской партии, преуспевающего фабриканта, спасшего во время Второй мировой войны более тысячи ста евреев. Это триумф одного человека, не похожего на других, и драма тех, кто, благодаря ему, выжил в ужасный период человеческой истории.",
        "release_date": "1993-12-15"
    },
    {
        "popularity": 19.214,
        "id": 79,
        "video": false,
        "vote_count": 1121,
        "vote_average": 7.5,
        "title": "Герой",
        "release_date": "2002-07-22",
        "original_language": "zh",
        "original_title": "英雄",
        "genre_ids": [
        18,
        12,
        28,
        36
        ],
        "backdrop_path": "/xC9DRxpKgqJKDYLa9mkNa74eX4q.jpg",
        "adult": false,
        "overview": "Китай расколот на княжества, но уже есть лидер, который хочет покорить соседей и стать императором объединенной страны. К нему засланы убийцы, безукоризненно владеющие боевыми искусствами; у них фольклорные имена Сломанный Меч, Летящий Снег и Небо.Их противник обозначен как Безымянный, он хочет защитить императора. Его разговор с Всесильным образует раму, скрепляющую несколько ретроспектив — поединков с убийцами. Он рассказывает об этих поединках как сказку, где истину не отличишь от выдумки. Своя версия есть и у императора.",
        "poster_path": "/fyzHQ6PFQmWucHWKGt1mLjX14Ay.jpg"
    },
    {
        "popularity": 28.529,
        "id": 101,
        "video": false,
        "vote_count": 8061,
        "vote_average": 8.3,
        "title": "Леон",
        "release_date": "1994-09-14",
        "original_language": "fr",
        "original_title": "Léon",
        "genre_ids": [
        53,
        80,
        18
        ],
        "backdrop_path": "/dXQ7HILRK1Tg33RT64JwbQI7Osh.jpg",
        "adult": false,
        "overview": "Профессиональный убийца Леон, не знающий пощады и жалости, знакомится со своей очаровательной соседкой Матильдой, семью которой расстреливают полицейские, замешанные в торговле наркотиками. Благодаря этому знакомству он впервые испытывает чувство любви, но… как коротка жизнь профессионального убийцы.",
        "poster_path": "/89HeLbp4Wt4X9ZrqAVva9nGV3PW.jpg"
    },
    {
        "popularity": 25.178,
        "vote_count": 15554,
        "video": false,
        "poster_path": "/oTiRsQCIHJPUR7wA1chpTf8j9go.jpg",
        "id": 13,
        "adult": false,
        "backdrop_path": "/wMgbnUVS9wbRGAdki8fqxKU1O0N.jpg",
        "original_language": "en",
        "original_title": "Forrest Gump",
        "genre_ids": [
        35,
        18,
        10749
        ],
        "title": "Форрест Гамп",
        "vote_average": 8.4,
        "overview": "От лица главного героя Форреста Гампа, слабоумного безобидного человека с благородным и открытым сердцем, рассказывается история его необыкновенной жизни.Фантастическим образом превращается он в известного футболиста, героя войны, преуспевающего бизнесмена. Он становится миллиардером, но остается таким же бесхитростным, глупым и добрым. Форреста ждет постоянный успех во всем, а он любит девочку, с которой дружил в детстве, но взаимность приходит слишком поздно.",
        "release_date": "2009-12-01"
    },
    {
        "popularity": 23.588,
        "vote_count": 6830,
        "video": false,
        "poster_path": "/diNkOPFsCTRpOslEQLidmJ6mKau.jpg",
        "id": 350,
        "adult": false,
        "backdrop_path": "/adGGzfXNmu0iLgiPAW9Ghd138f7.jpg",
        "original_language": "en",
        "original_title": "The Devil Wears Prada",
        "genre_ids": [
        35,
        18,
        10749
        ],
        "title": "Дьявол носит Prada",
        "vote_average": 7.3,
        "overview": "Мечтающая стать журналисткой провинциальная девушка Андреа по окончании университета получает должность помощницы всесильной Миранды Пристли, деспотичного редактора одного из крупнейших нью-йоркских журналов мод. Андреа всегда мечтала о такой работе, не зная, с каким нервным напряжением это будет связано…",
        "release_date": "2006-06-30"
    },
    {
        "popularity": 20.794,
        "vote_count": 6470,
        "video": false,
        "poster_path": "/prITVK0LHHrA1fUK2bP8HZyIcnW.jpg",
        "id": 745,
        "adult": false,
        "backdrop_path": "/1X6F9OvfaWl6AGcCdqYl8icxG9z.jpg",
        "original_language": "en",
        "original_title": "The Sixth Sense",
        "genre_ids": [
        18,
        9648,
        53
        ],
        "title": "Шестое чувство",
        "vote_average": 7.9,
        "overview": "Детский психиатр Малкольм Кроу сталкивается со странным случаем: девятилетнего Коула посещают страшные видения — призраки умерших. Все эти люди когда-то были убиты, и теперь они обрушивают на малыша свой гнетущий страх и отчаянный гнев.Как врач, Малкольм бессилен помочь. Но как человек, он пытается найти ключ к ужасному миру Коула, в котором веет дыхание смерти и распускаются страшные цветы боли.",
        "release_date": "2000-02-25"
    },
    {
        "popularity": 23.703,
        "id": 568,
        "video": false,
        "vote_count": 2955,
        "vote_average": 7.4,
        "title": "Аполлон 13",
        "release_date": "1995-06-30",
        "original_language": "en",
        "original_title": "Apollo 13",
        "genre_ids": [
        18,
        36
        ],
        "backdrop_path": "/dx7htIWzPs50HEWP0lyvjfyfKyt.jpg",
        "adult": false,
        "overview": "Фильм о неудачной лунной миссии «Аполлон-13» — одном из самых драматических моментов освоения космоса. В 1970 «Аполлон-13» должен был стать третьим космическим кораблём, который доставил бы астронавтов на Луну. Однако уже на подлёте к цели на корабле произошла серьёзная авария, которая не только поставила крест на высадке, но и создала угрозу жизни экипажа.",
        "poster_path": "/cor5NxgNJoEYIawLwTVxvhWQdLo.jpg"
    },
    {
        "popularity": 22.432,
        "vote_count": 5901,
        "video": false,
        "poster_path": "/aOI2EEZuKqZF8obmme27nZfBcKN.jpg",
        "id": 769,
        "adult": false,
        "backdrop_path": "/sw7mordbZxgITU877yTpZCud90M.jpg",
        "original_language": "en",
        "original_title": "GoodFellas",
        "genre_ids": [
        80,
        18
        ],
        "title": "Славные парни",
        "vote_average": 8.4,
        "overview": "Генри Хилл — начинающий гангстер, занимающийся грабежами вместе с Джими Конвеем и Томми Де Вито, которые с легкостью убивают любого, кто встает у них на пути восхождения к вершинам Мафии. Приходит время когда Генри, сам пострадавший от своих напарников, должен приложить руку к началу конца Джимми и Томми…",
        "release_date": "1990-09-12"
    },
    {
        "popularity": 18.912,
        "vote_count": 5687,
        "video": false,
        "poster_path": "/41bk8rHhQcDdNhRT5qfJmBARyRg.jpg",
        "id": 197,
        "adult": false,
        "backdrop_path": "/sAZAcvuJuBeUHMqF5RHnUrKRto2.jpg",
        "original_language": "en",
        "original_title": "Braveheart",
        "genre_ids": [
        28,
        18,
        36,
        10752
        ],
        "title": "Храброе сердце",
        "vote_average": 7.9,
        "overview": "Действие фильма начинается в 1280 году в Шотландии. Это история легендарного национального героя Уильяма Уолласа, посвятившего себя борьбе с англичанами при короле Эдварде Длинноногом.Он рано лишился отца, погибшего от рук англичан, и его забрал к себе дядя Оргайл, который дал ему хорошее образование в Европе. На родину Уильям возвращается уже взрослым человеком, мечтающем завести семью и жить мирной жизнью.",
        "release_date": "1995-05-24"
    },
    {
        "popularity": 23.373,
        "vote_count": 1553,
        "video": false,
        "poster_path": "/md93WN4YaVA4SGplddf0Fsm6Alb.jpg",
        "id": 8619,
        "adult": false,
        "backdrop_path": "/uuPbSNgk2dfhMH8l4cKSQUBBk6k.jpg",
        "original_language": "en",
        "original_title": "Master and Commander: The Far Side of the World",
        "genre_ids": [
        12,
        18,
        10752
        ],
        "title": "Хозяин морей: На краю Земли",
        "vote_average": 7.1,
        "overview": "Действие фильма разворачивается во время наполеоновских войн. Военный парусник Ее Величества «Сюрприз», бороздящий просторы Атлантики, был неожиданно атакован огромным неизвестным кораблем, появившимся из тумана. Благодаря смелости и находчивости команды «Сюрпризу» удается уйти от смерти. Несмотря на тяжелые повреждения и потери, капитан Джек Обри по прозвищу Счастливчик принимает решение преследовать врага и устремляется в погоню, которая уведет его на край света. На кону репутация Джека, его жизнь и жизнь его команды…",
        "release_date": "2003-11-14"
    },
    {
        "popularity": 23.406,
        "vote_count": 10108,
        "video": false,
        "poster_path": "/5fZ1JiGfVshoLHwgvdF3TY4bPem.jpg",
        "id": 98,
        "adult": false,
        "backdrop_path": "/5vZw7ltCKI0JiOYTtRxaIC3DX0e.jpg",
        "original_language": "en",
        "original_title": "Gladiator",
        "genre_ids": [
        28,
        12,
        18
        ],
        "title": "Гладиатор",
        "vote_average": 8.1,
        "overview": "В великой Римской империи не было военачальника, равного генералу Максимусу. Непобедимые легионы, которыми командовал этот благородный воин, боготворили его и могли последовать за ним даже в ад. Но случилось так, что отважный Максимус, готовый сразиться с любым противником в честном бою, оказался бессилен против вероломных придворных интриг. Генерала предали и приговорили к смерти. Чудом избежав гибели, Максимус становится гладиатором. Быстро снискав себе славу в кровавых поединках, он оказывается в знаменитом римском Колизее, на арене которого он встретится в смертельной схватке со своим заклятым врагом...",
        "release_date": "2000-05-01"
    },
    {
        "popularity": 24.272,
        "vote_count": 8805,
        "video": false,
        "poster_path": "/9eif6yaxtVY7j5ujoWIsHlDcBgd.jpg",
        "id": 857,
        "adult": false,
        "backdrop_path": "/hjQp148VjWF4KjzhsD90OCMr11h.jpg",
        "original_language": "en",
        "original_title": "Saving Private Ryan",
        "genre_ids": [
        18,
        36,
        10752
        ],
        "title": "Спасти рядового Райана",
        "vote_average": 8.1,
        "overview": "Капитан Джон Миллер получает тяжелое задание. Вместе с отрядом из восьми человек Миллер должен отправиться в тыл врага на поиски рядового Джеймса Райана, три родных брата которого почти одновременно погибли на полях сражений. Командование приняло решение демобилизовать Райана и отправить его на родину к безутешной матери. Но для того, чтобы найти и спасти солдата, крошечному отряду придется пройти через все круги ада...",
        "release_date": "1998-10-09"
    },
    {
        "popularity": 17.257,
        "vote_count": 6307,
        "video": false,
        "poster_path": "/s5wcYqvLBvcGhaOaigROCQqprBL.jpg",
        "id": 8358,
        "adult": false,
        "backdrop_path": "/frbW3kQXhVZPhceuQa1EqwZPXQr.jpg",
        "original_language": "en",
        "original_title": "Cast Away",
        "genre_ids": [
        12,
        18
        ],
        "title": "Изгой",
        "vote_average": 7.6,
        "overview": "Герой этой картины, Чак Нолан, — сотрудник всемирно известной службы доставки «Federal Express». Чак — скрупулезный практик и неисправимый педант. Жизнь Нолана, высокопоставленного инспектора международных отделений «FedEx» расписана по минутам. И этих драгоценных минут катастрофически не хватает ни на личную жизнь, ни на любимую женщину. Однако, безжалостная судьба заставила Нолана иначе взглянуть на отпущенное ему время... Самолет, на котором путешествует Чак, падает в океан. Инженер, единственный, кому посчастливилось остаться в живых, попадает на необитаемый остров. Здесь Нолану предстоит провести мучительно долгие годы в жестокой битве за выживание...",
        "release_date": "2001-01-24"
    }
    ]
}""".trimIndent()
val FAIL_RESPONSE = """
    {
    "page": 1,
    "total_results": 0,
    "total_pages": 0,
    "results": []
}
""".trimIndent()